app/models/user.rb

    def self.find_by_credentials(email, password)
        user = User.find(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]